app/controllers/admin/categories_controller.rb

UPDATE "categories" SET "position" = $1, "updated_at" = $2 WHERE "categories"."id" = 2  [["position", 1], ["updated_at", Sun, 16 Mar 2014 15:01:40 CST +08:00]]
---
  def sort
    categories = {}
    params[:p].split(',').each_with_index { |id, index| categories[id] = { position: index + 1 } }

    Category.update categories.keys, categories.values

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 ORDER BY "categories"."id" ASC LIMIT 1  [["id", "1"]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = 1  [["name", "燃面系列S店"], ["updated_at", Sun, 16 Mar 2014 14:57:49 CST +08:00]]
---
  def rename
    @category = Category.find(params[:category_id])
    @category.update_attributes(name: params[:value])