app/controllers/admin/users_controller.rb

  def update
    resource.update_attributes!(user_params)
---
UPDATE "users" SET "name" = $1, "points" = $2, "gender" = $3, "mobile_phone" = $4, "bio" = $5, "updated_at" = $6 WHERE "users"."id" = 1  [["name", "余震"], ["points", 2], ["gender", :male], ["mobile_phone", "18868783115"], ["bio", "管理员"], ["updated_at", Sun, 16 Mar 2014 14:14:38 CST +08:00]]