app/views/admin/orders/_list.html.haml

SELECT "orders".* FROM "orders" ORDER BY created_at desc
---
        %small
          - resource.order_items.each do |item|