app/controllers/photos_controller.rb

  def create
    @image = Photo.new
    @image.data = params[:image]
    @image.target_type = params[:page]
    @image.save!
---
INSERT INTO "photos" ("created_at", "data", "target_type", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 16 Mar 2014 14:24:39 CST +08:00], ["data", "0e887b42-1aa2-4b1e-8940-63ff5f646c1a.png"], ["target_type", "shop_logo"], ["updated_at", Sun, 16 Mar 2014 14:24:39 CST +08:00]]